In [1]:
import pandas as pd
import numpy as np

    目的 :  重命名索引 index columns
    工具 :  pd->  rename(index=str.title, colums = str.upper)   rename(index={x:y},columns={x1:y1} ,inplace=bool )
                       index.map(lambda x: x *2)

In [23]:
data = pd.DataFrame(np.arange(12).reshape(3,4),index=['Ohio','Colorado','New York'], columns=['one','two','three','four'])

In [24]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [25]:
transform = lambda x: x[ : 4].upper()

In [30]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [31]:
data.rename(index={'Ohio':'first'}, columns={'one':'fone'})

          fone  two  three  four
first        0    1      2     3
Colorado     4    5      6     7
New York     8    9     10    11

In [34]:
data.index.map( lambda x : x[:4].upper())

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [35]:
trans = lambda x : x[:3].upper()
data.index.map(trans)

Index(['OHI', 'COL', 'NEW'], dtype='object')

In [36]:
data.index = data.index.map(trans)

In [37]:
data

     one  two  three  four
OHI    0    1      2     3
COL    4    5      6     7
NEW    8    9     10    11

    举一反三 尝试 Series

In [38]:
s = pd.Series(np.arange(10))

In [39]:
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [44]:
s.rename(index={0:55})

55    0
1     1
2     2
3     3
4     4
5     5
6     6
7     7
8     8
9     9
dtype: int64

In [47]:
s.name = 'name for series'

In [48]:
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: name for series, dtype: int64

In [49]:
s.index

RangeIndex(start=0, stop=10, step=1)

In [50]:
s.index.map(lambda x : x*2)

Int64Index([0, 2, 4, 6, 8, 10, 12, 14, 16, 18], dtype='int64')

In [54]:
s.index = s.index.map(lambda x : x* 2 + 1)

In [55]:
s

1     0
5     1
9     2
13    3
17    4
21    5
25    6
29    7
33    8
37    9
Name: name for series, dtype: int64